# Svalbard laptop provisioning
# Desktop apps to install while you still have internet.
# CLI servers (kiwix-serve, pmtiles, llama-server) are bundled on the drive itself.
# Run: svb provision (interactive picker) or: brew bundle

# Knowledge & reading
cask "kiwix"              # Browse ZIM encyclopedias & references
cask "calibre"            # Ebook manager (Project Gutenberg EPUBs)
cask "thorium"            # EPUB reader

# Maps & GIS
cask "qgis"               # Full GIS — view PMTiles, geospatial analysis

# AI / LLMs
brew "ollama"             # Run GGUF models from the drive

# Media
cask "vlc"                # Play anything — video, audio, streams

# Making & fabrication
cask "freecad"            # Parametric CAD
cask "openscad@snapshot"  # Programmatic solid CAD
cask "orcaslicer"         # 3D printer slicer
cask "blender"            # Organic/artistic 3D modeling
cask "meshlab"            # STL mesh inspection & repair

# Electronics
cask "kicad"              # PCB design & schematic capture
brew "minicom"            # Serial monitor (talk to microcontrollers)
brew "platformio"         # ESP32/Arduino toolchain (bundles compilers + frameworks)
brew "gnuradio"           # Software-defined radio (pairs with amateur radio content)

# Development
cask "visual-studio-code" # Editor + PlatformIO IDE
brew "opencode"           # AI coding agent (terminal)
brew "gcc"                # GNU compiler (cross-compilation, embedded)
brew "node"               # JavaScript runtime
brew "go"                 # Static binaries, great for offline tooling
brew "rust"               # Systems programming, static binaries

# Imaging & flashing
cask "balenaetcher"       # Flash OS images to SD cards / USB drives
